Revit 2024 API
Parameter.CanBeAssociatedWithGlobalParameter Method
 Tests whether this parameter can be associated with the given global parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public bool CanBeAssociatedWithGlobalParameter(
	ElementId gpId
)
Visual Basic
Public Function CanBeAssociatedWithGlobalParameter ( _
	gpId As ElementId _
) As Boolean
Visual C++
public:
bool CanBeAssociatedWithGlobalParameter(
	ElementId^ gpId
)
Parameters
gpId
Type: Autodesk.Revit.DB.ElementId
 Id of a global parameter contained in this parameter's document
Return Value
 True if this parameter can be associated with the given global parameter; False otherwise.
Remarks
 Only properties defined as parametrizable can be associated with global parameters. That excludes any read-only and formula-driven parameters, as well as those that have other explicit or implicit restrictions imposed by Revit.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The input gpId is not of a valid global parameter of the given document. -or- This parameter does not exist in the document anymore.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
Parameter Class
Autodesk.Revit.DB Namespace